# โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ 
# และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
#     ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
 #    ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
  #   ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
   #  ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print('-----------------------------------')
print('โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
print('-----------------------------------')
emp_code = input('ป้อนรหัสพนักงาน : '); emp_name = input('ป้อนชื่อพนักงาน : '); emp_sale = float(input('ป้อนยอดขายของพนักงาน : '))
if emp_sale >= 3001 :
    emp_com = emp_sale *5/100
    print(f""""พนักงาน:{emp_name} |รหัส:{emp_code}
    ----ได้รับค่าคอม {emp_com} บาท----""")
elif emp_sale >= 2001 :
    emp_com = emp_sale *3/100
    print(f""""พนักงาน:{emp_name} |รหัส:{emp_code}
    ----ได้รับค่าคอม {emp_com} บาท----""")
elif emp_sale > 1001 :
    emp_com = emp_sale *1/100
    print(f""""พนักงาน:{emp_name} |รหัส:{emp_code}
    ----ได้รับค่าคอม {emp_com} บาท----""")
else :
    print(f""""พนักงาน:{emp_name} |รหัส:{emp_code}
    ----ไม่ได้รับค่าคอม----""")
print('-----------------------------------')
