# รับชื่อ ปีเกิด และตรวจสอบอายุหาเหิน 35 =คุณแก่แล้ว.... ถ้าไม่ใช่=คุณยังไม่แก่....

from datetime import datetime

print('--------------------------------')
print('    โปรแกรมตรวจสอบความอาวุโส     ')
print('--------------------------------')
ur_name = input('ป้อนชื่อของคุณ : ')
ur_yearborn = float(input('ป้อนปีพ.ศ.เกิดของคุณ : '))
print('--------------------------------')

ur_ages = (datetime.now().year +543) - ur_yearborn

if ur_ages >= 35 :
    print(f"คุณ{ur_name}ครับ ตอนนี้คุณอายุ{ur_ages}แล้ว... ใกล้ลงโรงแล้วนะครับ ใชีชีวิตดีๆไม่ประมาทนะครับ")
else :
    print(f"คุณ{ur_name}ครับ ตอนนี้คุณอายุ{ur_ages}แล้ว... ชีวิตยังอีกยาว ใชีชีวิตดีๆไม่ประมาทนะครับ")

print(""""ขอให้โชคดีกับชาตินี้ อย่าหวังชาติหน้า
      
    สวัสดีครับ....ขอบคุณที่ใช้บริการ""")

