# สร้างโปรแกรมคำนวณเงินเดือนสุทธิที่ต้องจ่ายหลังจากหักภาษีแล้ว 7% ของเงินเดือน และหักค่าประกันสังคม 3% ของเดือน
# โดยรับค่ารหัสพนักงาน ชื่อพนักงาน เิงนเดือน ทางแป้นพิมพ์ และแสดงผลข้อมูลที่รับมา
# พร้อมรายละเอียดว่าต้องเสียภาษีกี่บาท หักค่าประกัรสังคมกี่บาท และต้องจ่ายเงินเดือนสุทธิกี่บาท

print("----------------------------")
print("โปรแกรมการคำนวณเงินเดือนพนักงาน")
print("----------------------------")
emp_code = input("ป้อนรหัสพนักงาน: ")
emp_name = input("ป้อนชื่อพนักงาน: ")
emp_salary = float(input("ป้อนเงินเดือน: "))
print("----------------------------")
tax = emp_salary * 7/100
insur = emp_salary * 3/100
emp_salary_net = emp_salary - tax - insur
print(f"""
รหัสพนักงาน
{emp_code} 
---------
ชื่อพนักงาน
{emp_name}
---------

เงินเดือน = {emp_salary_net+tax+insur} บาท
หักภาษี 7% = {tax} บาท
หักประกันสังคม 3% = {insur} บาท
เงินเดือนสุทธิ = {emp_salary_net} บาท
""")
# ใช้ ,
print("----------------------------------------------------")
print("----------------------------------------------------")
print('     ')
print('รหัสพนักงาน')
print(emp_code)
print('---------')
print('ชื่อพนักงาน')
print(emp_name)
print('---------')
print('     ')
print('เงินเดือน','=',emp_salary_net+tax+insur,'บาท')
print('หักภาษี','7%','=',tax,'บาท')
print('หักประกันสังคม','3%','=',insur,'บาท')
print('เงินเดือนสุทธิ','=',emp_salary_net,'บาท')

# ใช้ +
print("----------------------------------------------------")
print("----------------------------------------------------")
print('     ')
print('รหัสพนักงาน')
print(emp_code)
print('---------')
print('ชื่อพนักงาน')
print(emp_name)
print('---------')
print('     ')
print('เงินเดือน'+' '+'='+' '+str(emp_salary_net+tax+insur)+'บาท')
print('หักภาษี'+' '+'7%'+' '+'='+' '+str(tax)+'บาท')
print('หักประกันสังคม'+' '+'3%'+' '+'='+' '+str(insur)+'บาท')
print('เงินเดือนสุทธิ'+' '+'='+' '+str(emp_salary_net)+'บาท')

# ใช้ Format
print("----------------------------------------------------")
print("----------------------------------------------------")
print('     ')
print('รหัสพนักงาน')
print(emp_code)
print('---------')
print('ชื่อพนักงาน')
print(emp_name)
print('---------')
print('     ')
print('เงินเดือน 7% = {} {}'.format(str(emp_salary_net+tax+insur),'บาท'))
print('หักภาษี 3% = {} {}'.format(tax,'บาท'))
print('หักประกันสังคม = {} {}'.format(insur,'บาท'))
print('เงินเดือนสุทธิ = {} {}'.format(emp_salary_net,'บาท'))
print("----------------------------------------------------")
print("----------------------------------------------------")
