# โปรแกรมตรวจสอบข้อมูลสายรถเมล์ โดยที่
#	หากผู้ใช้ป้อนสายรถเมล์ 57 แสดงข้อความ สาย  57 ไปปิ่นเกล้า บางขุนนนท์
#	หากผู้ใช้ป้อนสายรถเมล์ 3 แสดงข้อความ สาย  3 ไปสนามหลวง ลาดพร้าว
#	หากผู้ใช้ป้อนสายรถเมล์ 71 แสดงข้อความ สาย  71ไปหัวลำโพง เยาวราช
#	หากผูใช้ป้อนสายรถเมล์ 539 แสดงข้อความ สาย  539 ไปอนุสวรีย์ชัย สามเสน
#	หากผู้ใช้ป้อนสายรถเมล์สายอื่นนอกจากนี้ แสดงข้อความ ยังไม่มีข้อมูลสายรถเมล์ที่สอบถาม

print('--------------------------------')
print('   โปรแกรมตรวจสอบข้อมูลสายรถเมล์    ')
print('--------------------------------')

bus_route = input('ป้อนสายรถเมล์ที่ท่านโดยสาร : ')

if bus_route == '57' :
    print('สาย 57 ไปปิ่นเกล้า บางขุนนนท์')
elif bus_route == '3' :
    print('สาย 3 ไปสนามหลวง ลาดพร้าว')
elif bus_route == '71' :
    print('สาย 71 ไปหัวลำโพง เยาวราช')
elif bus_route == '539' :
    print('สาย 539 ไปอนุสวรีย์ชัย สามเสน')
else :
    print('ขออภัย ยังไม่มีข้อมูลสายรถเมล์ที่ท่านต้องการ')